In [1]:
import pandas as pd

In [2]:
df1 = pd.read_csv('01_Contract_Data.csv')

In [3]:
df1.columns

Index(['Index', 'Member_ID', 'Sales_Type', 'Contract_Type', 'Channel',
       'Datetime', 'Term', 'Payment_Type', 'Product_Type', 'Amount_Month',
       'Customer_Type', 'Age', 'Address1', 'Address2', 'State',
       'Overdue_count', 'Overdue_Type', 'Gender', 'Credit_Rank', 'Bank'],
      dtype='object')

In [4]:
df2 = df1[['Age','Overdue_count','Credit_Rank']]

In [5]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51301 entries, 0 to 51300
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Age            44329 non-null  float64
 1   Overdue_count  51301 non-null  int64
 2   Credit_Rank    42520 non-null  float64
dtypes: float64(2), int64(1)
memory usage: 1.2 MB

In [6]:
df2.isnull().sum()

Age              6972
Overdue_count       0
Credit_Rank      8781
dtype: int64

In [7]:
df2.dropna()

        Age  Overdue_count  Credit_Rank
0      42.0              0          9.0
1      39.0              0          2.0
2      48.0              0          8.0
3      39.0              0          5.0
4      60.0             12          8.0
...     ...            ...          ...
51295  45.0              0          1.0
51297  42.0              0          8.0
51298  65.0              0          1.0
51299  54.0              0          2.0
51300  53.0              0          8.0

[40648 rows x 3 columns]

In [8]:
# 이 칼럼에 결측치가 있는 칸이 나오면 0으로 채워줘

df2['Credit_Rank'].fillna(0)

0        9.0
1        2.0
2        8.0
3        5.0
4        8.0
        ...
51296    0.0
51297    8.0
51298    1.0
51299    2.0
51300    8.0
Name: Credit_Rank, Length: 51301, dtype: float64

In [9]:
# 모든 컬럼에 결측치가 있으면 0을 넣어줘

df2.fillna(0)

        Age  Overdue_count  Credit_Rank
0      42.0              0          9.0
1      39.0              0          2.0
2      48.0              0          8.0
3      39.0              0          5.0
4      60.0             12          8.0
...     ...            ...          ...
51296  47.0              0          0.0
51297  42.0              0          8.0
51298  65.0              0          1.0
51299  54.0              0          2.0
51300  53.0              0          8.0

[51301 rows x 3 columns]

In [10]:
# 간단한 impute를 하는 라이브러리 
# 참고 URL = https://scikit-learn.org/stable/modules/generated/sklearn.impute.SimpleImputer.html

from sklearn.impute import SimpleImputer

In [11]:
model_miss = SimpleImputer(strategy='median')
model_miss.fit(df2)

SimpleImputer(strategy='median')

In [12]:
# 각각의 dataFrame 줄을 numpy 형태로 한줄씩 뽑아서 넣어준다. 
# 결측치가 있는 애들을 transform 해준다. 
 
model_miss.transform(df2)

array([[42.,  0.,  9.],
       [39.,  0.,  2.],
       [48.,  0.,  8.],
       ...,
       [65.,  0.,  1.],
       [54.,  0.,  2.],
       [53.,  0.,  8.]])

In [13]:
pd.DataFrame(model_miss.transform(df2)).isnull().sum()

0    0
1    0
2    0
dtype: int64

In [14]:
# 각각의 column 최대값, 최소값 갯수 등의 데이터를 표현해주는 Pandas describe 메서드

df2.describe()

                Age  Overdue_count   Credit_Rank
count  44329.000000   51301.000000  42520.000000
mean      50.024093       0.161381      3.428810
std       10.983877       1.122193      2.213453
min       25.000000       0.000000      0.000000
25%       42.000000       0.000000      1.000000
50%       49.000000       0.000000      3.000000
75%       57.000000       0.000000      5.000000
max      102.000000      15.000000     10.000000

In [15]:
pd.DataFrame(model_miss.transform(df2)).describe()

                  0             1             2
count  51301.000000  51301.000000  51301.000000
mean      49.884915      0.161381      3.355412
std       10.216272      1.122193      2.021593
min       25.000000      0.000000      0.000000
25%       43.000000      0.000000      2.000000
50%       49.000000      0.000000      3.000000
75%       55.000000      0.000000      5.000000
max      102.000000     15.000000     10.000000